# Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns

# [ONLY ONE MANDATORY] Challenge 1
#### In this challenge we will use the `Temp_States`  dataset. 

#### First import it into a dataframe called `temp`.

In [3]:
temp = pd.read_csv("../Temp_states.csv")

#### Print `temp`.

In [6]:
temp

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

In [7]:
temp.shape

(7, 3)

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [14]:
temp.dtypes

City            object
State           object
Temperature    float64
dtype: object

In [ ]:
"""
object: string and float with limited number of characters
"""

#### Select the rows where state is New York.

In [24]:
rows_New_York = temp[temp['State'] == 'New York']
rows_New_York

      City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

#### What is the average temperature of cities in New York?

In [25]:
rows_New_York["Temperature"].mean()

10.74074074074074

#### Which states and cities have a temperature above 15 degrees Celsius?

In [28]:
warm_cities_states = temp[temp['Temperature'] > 15]
warm_cities_states

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222
5    Treton   New Jersey    22.222222
6    Newark   New Jersey    20.000000

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [32]:
warm_cities = warm_cities_states.drop(columns = "State")
warm_cities

       City  Temperature
0       NYC    19.444444
3  Hartford    17.222222
5    Treton    22.222222
6    Newark    20.000000

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [33]:
cities_betw15and20 = warm_cities[warm_cities['Temperature'] < 20]
cities_betw15and20

       City  Temperature
0       NYC    19.444444
3  Hartford    17.222222

#### Find the mean and standard deviation of the temperature of each state.

In [55]:
temp.groupby(["State"])["Temperature"].agg(["mean", "std"])

                  mean       std
State
Connecticut  15.833333  1.964186
New Jersey   21.111111  1.571348
New York     10.740741  8.133404

In [ ]:
#below you see my prior solution. It's a little too complicate as it involves unnecessary steps

In [54]:
#we already got New York, so lets start with that:
rows_New_York

      City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

In [39]:
rows_New_York.mean()

Temperature    10.740741
dtype: float64

In [40]:
rows_New_York.std()

Temperature    8.133404
dtype: float64

In [41]:
temp_NewYork = temp

In [45]:
#now lets investigate Conneticut
rows_Connecticut = temp[temp['State'] == 'Connecticut']
rows_Connecticut

         City        State  Temperature
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444

In [47]:
rows_Connecticut.mean()

Temperature    15.833333
dtype: float64

In [49]:
rows_Connecticut.std()

Temperature    1.964186
dtype: float64

In [50]:
#now lets investigate New jersey
rows_New_Jersey = temp[temp['State'] == 'New Jersey']
rows_New_Jersey

     City       State  Temperature
5  Treton  New Jersey    22.222222
6  Newark  New Jersey    20.000000

In [51]:
rows_New_Jersey.mean()

Temperature    21.111111
dtype: float64

In [52]:
rows_New_Jersey.std

<bound method DataFrame.std of      City       State  Temperature
5  Treton  New Jersey    22.222222
6  Newark  New Jersey    20.000000>

# [ONLY ONE MANDATORY]  Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [ ]:
# your code here

#### Explore the data types of the `employees` dataframe. Comment your results.

In [ ]:
# your code here

In [ ]:
"""
your comments here
"""

#### What's the average salary in this company?

In [ ]:
# your code here

#### What's the highest salary?

In [ ]:
# your code here

#### What's the lowest salary?

In [ ]:
# your code here

#### Who are the employees with the lowest salary?

In [ ]:
# your code here

#### Find all the information about an employee called David.

In [ ]:
# your code here

#### Could you return only David's salary?

In [ ]:
# your code here

#### Print all the rows where job title is associate.

In [ ]:
# your code here

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [ ]:
# Method 1
# your code here

In [ ]:
# Method 2
# your code here

#### Find the employees whose title is associate and whose salary is above 55.

In [ ]:
# your code here

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [ ]:
# your code here

####  What is the average salary per title?

In [ ]:
# your code here

####  Find the salary quartiles.

In [ ]:
# your code here

#### Is the mean salary different per gender?

In [ ]:
# your code here

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [ ]:
# your code here

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [ ]:
# your code here

# [ONLY ONE MANDATORY] Challenge 3
#### Open the `Orders` dataset. Name your dataset `orders`.

In [ ]:
# your code here

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [ ]:
# your code here

In [ ]:
"""
your comments here
"""

####  What is the average purchase price?

In [ ]:
# your code here

#### What are the highest and lowest purchase prices?

In [ ]:
# your code here

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [ ]:
# your code here

#### How many customers do we have in Spain?

In [ ]:
# your code here

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [ ]:
# your code here

#### Select orders from Spain that include more than 50 items.

In [ ]:
# your code here

#### Select all free orders.

In [ ]:
# your code here

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [ ]:
# your code here

#### Select all `lunch bag` orders made in 2011.

In [ ]:
# your code here

#### Show the frequency distribution of the amount spent in Spain.

In [ ]:
# your code here

#### Select all orders made in the month of August.

In [ ]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [ ]:
# your code here

#### What's the  average amount of money spent by country?

In [ ]:
# your code here

#### What's the most expensive item?

In [ ]:
# your code here

#### What is the average amount spent per year?

In [ ]:
# your code here